{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 11, 11, 11, 1], "name": "input_14", "sparse": false}, "inbound_nodes": [], "name": "input_14"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_27", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["input_14", 0, 0, {}]]], "name": "conv3d_27"}, {"class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_27", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2, 2], "padding": "valid", "strides": [2, 2, 2]}, "inbound_nodes": [[["conv3d_27", 0, 0, {}]]], "name": "max_pooling3d_27"}, {"class_name": "Conv3D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3d_28", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1, 1], "dilation_rate": [1, 1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3, 3]}, "inbound_nodes": [[["max_pooling3d_27", 0, 0, {}]]], "name": "conv3d_28"}, {"class_name": "MaxPooling3D", "config": {"name": "max_pooling3d_28", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2, 2], "padding": "valid", "strides": [2, 2, 2]}, "inbound_nodes": [[["conv3d_28", 0, 0, {}]]], "name": "max_pooling3d_28"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_14", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["max_pooling3d_28", 0, 0, {}]]], "name": "batch_normalization_14"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_14", "data_format": "channels_last"}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "flatten_14"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_27", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["flatten_14", 0, 0, {}]]], "name": "dense_27"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_28", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_27", 0, 0, {}]]], "name": "dense_28"}], "input_layers": [["input_14", 0, 0]], "output_layers": [["dense_28", 0, 0]], "name": "model_14"}, "backend": "tensorflow"}